# 1.两个列表进行合并操作

# 2.使用列表判断一个列表是否在另外一个列表中

# 3.列表的反转

# 4.列表的排序

# 5.实现对列表的增删改查功能

# 6.如何将0-10随机存入列表中

# 7.求出元组(90,34,-23,18,12)中的最大值和最小值

# 8. 针对列表[90,34,-23,18,12]从小到大进行排序，然后 输出排序后结果

# 9. 编程输出所有的三位水仙花数 水仙花数:各位数字的立
# 方数相加等于该数本身 例如 153 1*1*1+5*5*5
# +3*3*3=153 153就是一个三位水仙花数

# 10.为哈希表追加不重复的100个值，且每个值都是1-100
# 之间的随机数，问哪个数字重复的次数最多，重复了多少
# 次？

# 11.假定书籍的种类有5种，设计何种的数据结构可以达到 快速查询某类所有书籍的功能（提示：用
# Dictionary<K,V>）

# 思考题：
# 1.如何实现一个单向链表

# 2.解析用户输入的一个算数表达式 算出其结果(选作)
# 2-1.没有括号和负号（中等难度）
# 2-2.带括号和负号（高难度）

# 3.如何用队列实现约瑟夫环
# 约瑟夫环：假设有n个人坐成一圈，从某个人开始报数，
# 数到m的人出圈，接着从出圈的下一个人开始重新报数，
# 数到m的人再次出圈，如此反复，直到所有人都出圈，请 列出出圈顺序。